<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>计算机网络 | AWSL</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../algorithm/algorithm.html" />
    
    
    <link rel="prev" href="../index.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="1"
        data-chapter-title="计算机网络"
        data-filepath="computerNetwork/network.md"
        data-basepath=".."
        data-revision="Sat Nov 14 2020 13:39:48 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        简介
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="1" data-path="computerNetwork/network.html">
            
                
                    <a href="../computerNetwork/network.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        计算机网络
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="algorithm/algorithm.html">
            
                
                    <a href="../algorithm/algorithm.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        算法
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="algorithm/algorithmBase.html">
            
                
                    <a href="../algorithm/algorithmBase.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        算法类别
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="algorithm/sort.html">
            
                
                    <a href="../algorithm/sort.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        排序算法
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >AWSL</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;">&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;</h1>
<h2 id="tcpip">TCP/IP</h2>
<h3 id="&#x57FA;&#x7840;&#x6982;&#x5FF5;">&#x57FA;&#x7840;&#x6982;&#x5FF5;</h3>
<ol>
<li><p>&#x534F;&#x8BAE;&#xFF1A;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x7684;&#x53CC;&#x65B9;&#x6240;&#x9075;&#x5B88;&#x7684;&#x89C4;&#x5B9A;&#x3002;</p>
</li>
<li><p>TCP/IP&#x534F;&#x8BAE;&#xFF1A;&#x4E92;&#x8054;&#x7F51;&#x76F8;&#x5173;&#x7684;&#x5404;&#x7C7B;&#x534F;&#x8BAE;&#x65CF;&#x7684;&#x603B;&#x79F0;&#xFF0C;&#x5982;&#xFF1A;UDP&#x3001;FTP&#x3001;HTTP&#x3001;TCP&#x7B49;&#x3002;<br><img src="../images/tcpip.png" alt="TCP/IP"></p>
</li>
<li><p>IP&#x534F;&#x8BAE;<br><code>IP</code>&#x548C;<code>IP&#x5730;&#x5740;</code>&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x3002;<br>IP&#x5730;&#x5740;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x88AB;&#x5206;&#x914D;&#x5230;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982;&#xFF1A;<a href="http://127.0.0.1" target="_blank">http://127.0.0.1</a><br>IP&#xFF08;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF09;&#x662F;&#x4F4D;&#x4E8E;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x8D1F;&#x8D23;&#x4F20;&#x8F93;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x7684;&#x4E00;&#x79CD;&#x534F;&#x8BAE;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x90FD;&#x4F1A;&#x7528;&#x5230;IP&#x534F;&#x8BAE;&#xFF08;IP&#x9760;&#x8FD1;&#x5E95;&#x5C42;&#xFF0C;&#x5E76;&#x4E14;&#x8D1F;&#x8D23;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#xFF0C;&#x96BE;&#x4EE5;&#x7ED5;&#x8FC7;&#xFF09;&#x3002;
IP&#x4F7F;&#x7528;IP&#x5730;&#x5740;&#x548C;MAC&#x5730;&#x5740;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x786E;&#x5B9E;&#x7684;&#x4F20;&#x9001;&#x5230;&#x5BF9;&#x65B9;&#xFF0C;
&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5728;&#x591A;&#x4E2A;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4E2D;&#x8F6C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;ARP&#x534F;&#x8BAE;&#xFF0C;&#x6839;&#x636E;IP&#x5730;&#x5740;&#x6765;&#x53CD;&#x67E5;MAC&#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x51ED;&#x501F;MAC&#x5730;&#x5740;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;</p>
</li>
<li><p>TCP&#x534F;&#x8BAE;<br>TCP&#x534F;&#x8BAE;&#x4F4D;&#x4E8E;&#x4F20;&#x8F93;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;<code>&#x53EF;&#x9760;</code>&#x7684;&#x5B57;&#x8282;&#x6D41;&#x670D;&#x52A1;&#x3002;<br>TCP&#x534F;&#x8BAE;&#x5C06;&#x5927;&#x7684;&#x6570;&#x636E;&#x5206;&#x5272;&#x4E3A;&#x4EE5;<code>&#x62A5;&#x6587;&#x6BB5;</code>&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x901A;&#x8FC7;<code>&#x4E09;&#x6B21;&#x63E1;&#x624B;</code>&#x7B56;&#x7565;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x80FD;&#x591F;&#x51C6;&#x786E;&#x65E0;&#x8BEF;&#x7684;&#x53D1;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#x3002;
&#x5982;&#x679C;&#x63E1;&#x624B;&#x8FC7;&#x7A0B;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#xFF0C;TCP&#x534F;&#x8BAE;&#x4F1A;&#x518D;&#x6B21;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;<br>SYN&#xFF08;&#x540C;&#x6B65;&#xFF09;ACK&#xFF08;&#x786E;&#x8BA4;&#xFF09;<br><img src="../images/three_hands.png" alt="TCP/IP"></p>
</li>
<li><p>DNS&#x670D;&#x52A1;<br>DNS&#xFF1A;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x670D;&#x52A1;&#xFF0C;&#x4F4D;&#x4E8E;&#x5E94;&#x7528;&#x5C42;&#x3002;<br>&#x63D0;&#x4F9B;&#x57DF;&#x540D;&#x5230;IP&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x6790;&#x670D;&#x52A1;&#x6216;IP&#x5730;&#x5740;&#x53CD;&#x67E5;&#x57DF;&#x540D;&#x3002;</p>
</li>
<li><p>URI&#x548C;URL<br>URI&#xFF1A;&#x7EDF;&#x4E00;&#x8D44;&#x6E90;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x7B80;&#x5355;&#x8BF4;URI&#x662F;&#x67D0;&#x4E2A;&#x534F;&#x8BAE;&#x65B9;&#x6848;&#x8868;&#x793A;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x5B9A;&#x4F4D;&#x6807;&#x8BC6;&#x7B26;&#x3002;<br>URL&#xFF1A;&#x7EDF;&#x4E00;&#x8D44;&#x6E90;&#x5B9A;&#x4F4D;&#x7B26;&#x3002;URL&#x662F;URI&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x7F51;&#x5740;&#x5C31;&#x662F;&#x4F7F;&#x7528;URL&#x6765;&#x8868;&#x793A;&#x7684;&#x3002;</p>
</li>
<li><p>&#x4EE3;&#x7406;<br>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;
<code>&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;</code>&#xFF1A;&#x57FA;&#x672C;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x63A5;&#x6536;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#x8F6C;&#x53D1;&#x7ED9;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x6539;&#x53D8;&#x8BF7;&#x6C42;URI&#x5E76;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5230;&#x524D;&#x65B9;&#x6301;&#x6709;&#x8D44;&#x6E90;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;<br><code>&#x6E90;&#x670D;&#x52A1;&#x5668;</code>&#xFF1A;&#x6301;&#x6709;&#x8D44;&#x6E90;&#x5B9E;&#x4F53;&#x7684;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x79F0;&#x4E3A;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4ECE;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7ECF;&#x8FC7;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x540E;&#x518D;&#x4F20;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;<br>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x6280;&#x672F;&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x5BBD;&#x5E26;&#xFF0C;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x7B49;&#x3002;<br>&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4E3B;&#x8981;&#x5206;&#x4E3A;<code>&#x7F13;&#x5B58;&#x4EE3;&#x7406;</code>&#x548C;<code>&#x900F;&#x660E;&#x4EE3;&#x7406;</code>&#x3002;&#x7F13;&#x5B58;&#x5E26;&#x7406;&#x4F1A;&#x9884;&#x5148;&#x5C06;&#x8D44;&#x6E90;&#x526F;&#x672C;&#x7F13;&#x5B58;&#x5230;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4FBF;&#x4E8E;&#x540E;&#x7EED;&#x8BBF;&#x95EE;&#xFF0C;&#x900F;&#x660E;&#x4EE3;&#x7406;&#x8F6C;&#x53D1;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x65F6;&#xFF0C;&#x4E0D;&#x5BF9;&#x62A5;&#x6587;&#x505A;&#x4EFB;&#x4F55;&#x52A0;&#x5DE5;&#x3002;&#x53CD;&#x4E4B;&#x4E3A;&#x975E;&#x900F;&#x660E;&#x4EE3;&#x7406;&#x3002;</p>
</li>
<li><p>&#x7F51;&#x5173;&#x548C;&#x96A7;&#x9053;<br><code>&#x7F51;&#x5173;</code>&#xFF1A;&#x7F51;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x548C;&#x4EE3;&#x7406;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x7F51;&#x5173;&#x53EF;&#x4EE5;&#x5C06;HTTP&#x8BF7;&#x6C42;&#x8F6C;&#x5316;&#x4E3A;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;&#x5229;&#x7528;&#x7F51;&#x5173;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x901A;&#x4FE1;&#x5B89;&#x5168;&#x6027;&#x3002;<br><code>&#x96A7;&#x9053;</code>&#xFF1A;&#x96A7;&#x9053;&#x53EF;&#x6309;&#x8981;&#x6C42;&#x5EFA;&#x7ACB;&#x8D77;&#x4E00;&#x6761;&#x4E0E;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x7684;&#x901A;&#x4FE1;&#x7EBF;&#x8DEF;&#xFF0C;&#x96A7;&#x9053;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x53BB;&#x89E3;&#x6790;HTTP&#x534F;&#x8BAE;&#x3002;&#x76EE;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x5BA2;&#x6237;&#x7AEF;&#x80FD;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x7684;&#x901A;&#x4FE1;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x534F;&#x8BAE;&#x5206;&#x5C42;">&#x534F;&#x8BAE;&#x5206;&#x5C42;</h3>
<p>&#x534F;&#x8BAE;&#x5206;&#x5C42;&#x7684;&#x597D;&#x5904;&#xFF1A;&#x53EF;&#x4EE5;&#x89E3;&#x8026;&#xFF0C;&#x660E;&#x786E;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x5212;&#x5206;&#xFF0C;&#x4FBF;&#x4E8E;&#x540E;&#x7EED;&#x534F;&#x8BAE;&#x7EF4;&#x62A4;&#x4EE5;&#x53CA;&#x53D8;&#x66F4;&#x3002;</p>
<ol>
<li>&#x5E94;&#x7528;&#x5C42;<br>&#x7B80;&#x5355;&#x7406;&#x89E3;&#x5E94;&#x7528;&#x5C42;&#x662F;&#x6700;&#x8D34;&#x8FD1;&#x7528;&#x6237;&#x7684;&#x4E00;&#x5C42;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5E94;&#x7528;&#x5C42;&#x51B3;&#x5B9A;&#x4E86;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x65F6;&#x7684;&#x901A;&#x4FE1;&#x6D3B;&#x52A8;&#x3002;<br>&#x5982;&#xFF1A;FTP(&#x6587;&#x4EF6;&#x4F20;&#x8F93;&#x534F;&#x8BAE;)&#x548C;DNS(&#x57DF;&#x540D;&#x7CFB;&#x7EDF;)&#x3001;http&#x534F;&#x8BAE;&#x7B49;&#x3002;</li>
<li>&#x4F20;&#x8F93;&#x5C42;<br>&#x7B80;&#x5355;&#x8BF4;&#x4F20;&#x8F93;&#x5C42;&#x8D1F;&#x8D23;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;&#x4F20;&#x8F93;&#x5C42;&#x9488;&#x5BF9;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5904;&#x4E8E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;<br>&#x4F20;&#x8F93;&#x5C42;&#x6709;&#x4E24;&#x4E2A;&#x6027;&#x8D28;&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#xFF1A;TCP(&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;)&#x548C;UDP(&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;)&#x3002;</li>
<li>&#x7F51;&#x7EDC;&#x5C42;<br>&#x7B80;&#x5355;&#x8BF4;&#x7F51;&#x7EDC;&#x5C42;&#xFF08;&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x5C42;&#xFF09;&#x51B3;&#x5B9A;&#x4E86;&#x901A;&#x8FC7;&#x600E;&#x6837;&#x7684;&#x8DEF;&#x5F84;&#x5C06;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x4F20;&#x8F93;&#x7ED9;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x3002;<br>&#x6570;&#x636E;&#x5305;&#x662F;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x636E;&#x5355;&#x4F4D;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x4E0A;&#x6D41;&#x52A8;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5E76;&#x51B3;&#x5B9A;&#x5C06;&#x6570;&#x636E;&#x5305;&#x4F20;&#x9012;&#x7ED9;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4F20;&#x8F93;&#x8DEF;&#x7EBF;&#xFF08;&#x7F51;&#x7EDC;&#x4E0A;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;/&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x8F93;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x51B3;&#x5B9A;&#x8FD9;&#x4E2A;&#x8DEF;&#x7EBF;&#xFF09;&#x3002;<br>&#x5982;&#xFF1A;IP&#xFF08;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF09;</li>
<li>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;
&#x524D;&#x4E09;&#x5C42;&#x90FD;&#x662F;&#x8F6F;&#x4EF6;&#x5C42;&#x9762;&#xFF0C;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5904;&#x4E8E;&#x786C;&#x4EF6;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#x786C;&#x4EF6;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#xFF1A;&#x63A7;&#x5236;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x786C;&#x4EF6;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x3001;NIC&#xFF08;&#x7F51;&#x7EDC;&#x9002;&#x914D;&#x5668;&#xFF08;&#x7F51;&#x5361;&#xFF09;&#xFF09;&#x4EE5;&#x53CA;&#x5149;&#x7EA4;&#x7B49;&#x7269;&#x7406;&#x53EF;&#x89C1;&#x90E8;&#x5206;&#x3002;</li>
</ol>
<p><img src="../images/tcpip_tran.png" alt="TCP/IP">       </p>
<hr>
<h2 id="http">HTTP</h2>
<h3 id="&#x4EC0;&#x4E48;&#x662F;http">&#x4EC0;&#x4E48;&#x662F;HTTP</h3>
<p>HTTP&#x534F;&#x8BAE;&#x901A;&#x8FC7;<code>&#x8BF7;&#x6C42;</code>&#x548C;<code>&#x54CD;&#x5E94;</code>&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x901A;&#x4FE1;&#x3002;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x6587;&#x672C;&#x6216;&#x56FE;&#x50CF;&#x7B49;&#x8D44;&#x6E90;&#x7684;&#x4E00;&#x7AEF;&#x79F0;&#x4E3A;<code>&#x5BA2;&#x6237;&#x7AEF;</code>&#xFF0C;&#x800C;&#x63D0;&#x4F9B;&#x8D44;&#x6E90;&#x54CD;&#x5E94;&#x7684;&#x4E00;&#x7AEF;&#x79F0;&#x4E3A;<code>&#x670D;&#x52A1;&#x7AEF;</code>&#x3002;</p>
<h4 id="&#x8981;&#x70B9;">&#x8981;&#x70B9;</h4>
<ol>
<li><p>HTTP&#x662F;&#x65E0;&#x72B6;&#x6001;&#x534F;&#x8BAE;<br>HTTP&#x4E0D;&#x5BF9;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#xFF0C;&#x5373;&#x6BCF;&#x6B21;&#x6709;&#x65B0;&#x7684;&#x8BF7;&#x6C42;&#x65F6;&#x4FBF;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x54CD;&#x5E94;&#x4EA7;&#x751F;&#xFF0C;&#x534F;&#x8BAE;&#x4E0D;&#x4FDD;&#x7559;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x7684;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x7684;&#x62A5;&#x6587;&#x4FE1;&#x606F;&#x3002;<br>&#x8FD9;&#x4E00;&#x8BBE;&#x8BA1;&#x6709;&#x52A9;&#x4E8E;&#x534F;&#x8BAE;&#x66F4;&#x5FEB;&#x7684;&#x5904;&#x7406;&#x5927;&#x91CF;&#x4E8B;&#x52A1;&#xFF0C;&#x786E;&#x4FDD;&#x534F;&#x8BAE;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5BFC;&#x81F4;&#x4E86;&#x67D0;&#x4E9B;&#x4E1A;&#x52A1;&#x7684;&#x5904;&#x7406;&#x53D8;&#x5F97;&#x9EBB;&#x70E6;&#xFF0C;&#x5982;&#x767B;&#x5F55;&#x72B6;&#x6001;&#x7684;&#x7BA1;&#x7406;&#x3002;</p>
</li>
<li><p>HTTP&#x901A;&#x8FC7;URI&#x5B9A;&#x4F4D;&#x8D44;&#x6E90;<br>HTTP&#x4F7F;&#x7528;URI&#x5B9A;&#x4F4D;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5C06;&#x8BE5;&#x8D44;&#x6E90;&#x7684;URI&#x653E;&#x5165;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x6765;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x3002;</p>
</li>
<li><p>&#x4E3B;&#x8981;&#x65B9;&#x6CD5;       </p>
</li>
</ol>
<table>
<thead>
<tr>
<th>&#x65B9;&#x6CD5;</th>
<th>&#x8BF4;&#x660E;</th>
<th>&#x652F;&#x6301;&#x7684;HTTP&#x7248;&#x672C;</th>
</tr>
</thead>
<tbody>
<tr>
<td>GET</td>
<td>&#x83B7;&#x53D6;URI&#x8D44;&#x6E90;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x6587;&#x672C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x63A5;&#x53E3;&#x5219;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;&#x4E5F;&#x53EF;&#x4F20;&#x8F93;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#xFF08;&#x4F20;&#x53C2;&#xFF0C;&#x660E;&#x6587;&#x4F20;&#x8F93;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF09;</td>
<td>1.0&#x3001;1.1</td>
</tr>
<tr>
<td>POST</td>
<td>&#x4F20;&#x8F93;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#xFF08;&#x4F20;&#x53C2;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;URI&#x54CD;&#x5E94;&#x5185;&#x5BB9;</td>
<td>1.0&#x3001;1.1</td>
</tr>
<tr>
<td>PUT</td>
<td>&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#xFF0C;&#x5C06;&#x6587;&#x4EF6;&#x5B58;&#x4E8E;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x4E2D;&#x4F20;&#x8F93;&#xFF0C;&#x6CA1;&#x6709;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x6027;&#x95EE;&#x9898;</td>
<td>1.0&#x3001;1.1</td>
</tr>
<tr>
<td>HEAD</td>
<td>&#x83B7;&#x53D6;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x9996;&#x90E8;&#xFF0C;&#x540C;GET&#x65B9;&#x6CD5;&#x53EA;&#x662F;&#x4E0D;&#x8FD4;&#x56DE;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x90E8;&#x5206;</td>
<td>1.0&#x3001;1.1</td>
</tr>
<tr>
<td>DELETE</td>
<td>&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x8BF7;&#x6C42;URI&#x5220;&#x9664;&#x6307;&#x5B9A;&#x8D44;&#x6E90;&#xFF0C;&#x6CA1;&#x6709;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x95EE;&#x9898;</td>
<td>1.0&#x3001;1.1</td>
</tr>
<tr>
<td>OPTIONS</td>
<td>&#x67E5;&#x8BE2;&#x8BE5;URI&#x6240;&#x6307;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#x652F;&#x6301;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x5982;&#xFF1A;GET&#x3001;POST&#x7B49;&#xFF09;</td>
<td>1.1</td>
</tr>
<tr>
<td>TRACE</td>
<td>&#x8DEF;&#x5F84;&#x8FFD;&#x8E2A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;Web&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BF7;&#x6C42;&#x8DEF;&#x5F84;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x786E;&#x8BA4;&#x8FDE;&#x63A5;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#xFF0C;&#x5BB9;&#x6613;&#x5F15;&#x53D1;&#x8DE8;&#x7AD9;&#x8FFD;&#x8E2A;&#x653B;&#x51FB;</td>
<td>1.1</td>
</tr>
<tr>
<td>CONNECT</td>
<td>&#x8981;&#x6C42;&#x4F7F;&#x7528;&#x96A7;&#x9053;&#x534F;&#x8BAE;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7528;&#x96A7;&#x9053;&#x534F;&#x8BAE;&#x8FDB;&#x884C;TCP&#x901A;&#x4FE1;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;SSL&#x548C;TSL&#x534F;&#x8BAE;&#x628A;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x52A0;&#x5BC6;&#x540E;&#x901A;&#x8FC7;&#x96A7;&#x9053;&#x4F20;&#x8F93;</td>
<td>1.1</td>
</tr>
<tr>
<td>LINK</td>
<td>HTTP1.1&#x5DF2;&#x5E9F;&#x5F03;</td>
<td>1.0</td>
</tr>
<tr>
<td>UNLINK</td>
<td>HTTP1.1&#x5DF2;&#x5E9F;&#x5F03;</td>
<td>1.0</td>
</tr>
</tbody>
</table>
<ol>
<li>HTTP&#x6301;&#x4E45;&#x8FDE;&#x63A5;</li>
</ol>
<p>&#x7531;&#x4E8E;HTTP&#x534F;&#x8BAE;&#x521D;&#x59CB;&#x7248;&#x672C;&#x4E2D;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B21;HTTP&#x901A;&#x4FE1;&#x5C31;&#x8981;&#x65AD;&#x5F00;&#x4E00;&#x6B21;TCP&#x8FDE;&#x63A5;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x7684;&#x7F51;&#x9875;&#x4E2D;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x56FE;&#x7247;&#x8D44;&#x6E90;&#x7B49;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x7684;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x5BFC;&#x81F4;&#x9891;&#x7E41;&#x5EFA;&#x7ACB;&#x4E0E;&#x65AD;&#x5F00;TCP&#x8FDE;&#x63A5;&#xFF0C;&#x589E;&#x52A0;&#x901A;&#x4FE1;&#x91CF;&#x5F00;&#x9500;&#xFF0C;&#x6240;&#x4EE5;HTTP1.1&#x548C;&#x90E8;&#x5206;1.0&#x589E;&#x52A0;&#x4E86;<code>&#x6301;&#x4E45;&#x8FDE;&#x63A5;</code>&#x529F;&#x80FD;&#x3002;<br>&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x7279;&#x70B9;&#xFF1A;&#x4EFB;&#x610F;&#x4E00;&#x7AEF;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x63D0;&#x51FA;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x5219;&#x53CC;&#x65B9;&#x4FDD;&#x6301;TCP&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x3002;<br>&#x4F18;&#x70B9;&#xFF1A;&#x51CF;&#x5C11;&#x4E86;TCP&#x91CD;&#x590D;&#x8FDE;&#x63A5;&#x548C;&#x65AD;&#x5F00;&#x7684;&#x7F51;&#x7EDC;&#x5F00;&#x9500;&#xFF0C;&#x51CF;&#x8F7B;&#x670D;&#x52A1;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x63D0;&#x9AD8;HTTP&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#xFF0C;&#x4F7F;HTTP&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5E76;&#x53D1;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#xFF08;&#x591A;&#x8BF7;&#x6C42;&#x65F6;&#x660E;&#x663E;&#x51CF;&#x5C11;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF09;&#x3002;</p>
<ol>
<li>Cookie</li>
</ol>
<p>&#x7531;&#x4E8E;HTTP&#x662F;&#x65E0;&#x72B6;&#x6001;&#x534F;&#x8BAE;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x5BFC;&#x81F4;&#x7F51;&#x7AD9;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;&#x7528;&#x6237;&#x767B;&#x5F55;&#x72B6;&#x6001;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x95EE;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F15;&#x5165;&#x4E86;<code>Cookie&#x6280;&#x672F;</code>&#x3002;<br>Cookie&#x6280;&#x672F;&#x901A;&#x8FC7;&#x5728;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x5199;&#x5165;Cookie&#x6765;&#x63A7;&#x5236;&#x5BA2;&#x6237;&#x7AEF;&#x72B6;&#x6001;&#x3002;<br>&#x8FC7;&#x7A0B;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x8BF7;&#x6C42;--&gt; &#x670D;&#x52A1;&#x7AEF;&#x5728;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x901A;&#x8FC7;&#x9996;&#x90E8;&#x5B57;&#x6BB5;Set-Cookie&#xFF0C;&#x901A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x4FDD;&#x5B58;Cookie&#x4FE1;&#x606F;--&gt; &#x5BA2;&#x6237;&#x7AEF;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#x4F1A;&#x5728;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x81EA;&#x52A8;&#x52A0;&#x5165;Cookie&#x503C;--&gt; &#x670D;&#x52A1;&#x7AEF;&#x6536;&#x5230;&#x5BA2;&#x6237;&#x90FD;&#x7684;Cookie&#x503C;&#x5BF9;&#x6BD4;&#x670D;&#x52A1;&#x5668;&#x8BB0;&#x5F55;&#x6765;&#x786E;&#x8BA4;&#x5BA2;&#x6237;&#x7AEF;&#x72B6;&#x6001;</p>
<h3 id="http&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x7B80;&#x8FF0;">HTTP&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x7B80;&#x8FF0;</h3>
<ol>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x60F3;&#x8981;&#x5411;&#x67D0;&#x4E2A;&#x7F51;&#x5740;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF08;&#x5982;&#xFF1A;<a href="http://www.baidu.com&#xFF09;--&gt;" target="_blank">http://www.baidu.com&#xFF09;--&gt;</a> DNS&#x5C06;&#x7F51;&#x5740;&#x89E3;&#x6790;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;IP&#x5730;&#x5740;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x5982;&#xFF1A;<a href="http://127.0.0.1&#xFF09;&#x3002;" target="_blank">http://127.0.0.1&#xFF09;&#x3002;</a></li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#xFF1A;HTTP&#x534F;&#x8BAE;&#x751F;&#x4EA7;&#x9488;&#x5BF9;&#x76EE;&#x6807;&#x7F51;&#x7AD9;&#x7684;&#x62A5;&#x6587;--&gt; TCP&#x534F;&#x8BAE;&#x5C06;HTTP&#x62A5;&#x6587;&#x5206;&#x5272;&#x6210;&#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x5E76;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x9012;&#x7ED9;&#x5BF9;&#x65B9;--&gt; IP&#x534F;&#x8BAE;&#x641C;&#x7D22;&#x5BF9;&#x65B9;&#x5730;&#x5740;&#xFF0C;&#x5C06;HTTP&#x62A5;&#x6587;&#x6BB5;&#x7ECF;&#x7531;&#x5408;&#x9002;&#x7684;&#x8DEF;&#x5F84;&#x53D1;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x7AEF;&#x63A5;&#x6536;&#xFF1A;TCP&#x534F;&#x8BAE;&#x63A5;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x901A;&#x8FC7;IP&#x534F;&#x8BAE;&#x53D1;&#x9001;&#x7684;&#x62A5;&#x6587;&#x6BB5;--&gt; TCP&#x534F;&#x8BAE;&#x5C06;&#x6536;&#x5230;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#x91CD;&#x65B0;&#x7EC4;&#x5408;&#x4E3A;&#x5B8C;&#x6574;&#x7684;HTTP&#x62A5;&#x6587;--&gt; HTTP&#x534F;&#x8BAE;&#x901A;&#x8FC7;&#x62A5;&#x6587;&#x660E;&#x786E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#x5185;&#x5BB9;&#x3002;</li>
</ol>
<p><img src="../images/http_1.png" alt="HTTP">     </p>
<h3 id="http&#x62A5;&#x6587;">HTTP&#x62A5;&#x6587;</h3>
<p>HTTP&#x62A5;&#x6587;&#x5206;&#x4E3A;<code>&#x8BF7;&#x6C42;&#x62A5;&#x6587;</code>&#x548C;<code>&#x54CD;&#x5E94;&#x62A5;&#x6587;</code>&#x3002;&#x62A5;&#x6587;&#x662F;&#x7531;&#x591A;&#x884C;&#x6570;&#x636E;&#x6784;&#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x672C;&#xFF0C;&#x5176;&#x4E2D;&#x6807;&#x8BC6;&#x4E86;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x9700;&#x5185;&#x5BB9;&#x3002;<br>&#x62A5;&#x6587;&#x7EC4;&#x6210;&#xFF1A;<br>    &#x8BF7;&#x6C42;&#x884C;&#xFF08;&#x4F4D;&#x4E8E;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#xFF09;&#xFF0C;&#x5305;&#x542B;<code>&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;</code>&#x3001;<code>URI</code>&#x3001;<code>HTTP&#x7248;&#x672C;</code>&#x4E09;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;<br>    &#x72B6;&#x6001;&#x884C;&#xFF08;&#x4F4D;&#x4E8E;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#xFF09;&#xFF0C;&#x5305;&#x542B;&#x8868;&#x793A;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x7684;<code>&#x72B6;&#x6001;&#x7801;</code>&#x3001;<code>&#x539F;&#x56E0;&#x77ED;&#x8BED;</code>&#x3001;<code>HTTP&#x7248;&#x672C;</code>&#x4E09;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;<br>    &#x9996;&#x90E8;&#x5B57;&#x6BB5;&#xFF08;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x90FD;&#x5305;&#x542B;&#xFF09;&#xFF0C;&#x5305;&#x542B;&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x7684;&#x5404;&#x79CD;<code>&#x6761;&#x4EF6;</code>&#x548C;<code>&#x5C5E;&#x6027;</code>&#x7684;&#x5404;&#x7C7B;&#x9996;&#x90E8;&#x3002;&#x9996;&#x90E8;&#x4E00;&#x822C;&#x6709;&#x56DB;&#x79CD;&#xFF1A;<code>&#x901A;&#x7528;&#x9996;&#x90E8;</code>&#x3001;<code>&#x8BF7;&#x6C42;&#x9996;&#x90E8;</code>&#x3001;<code>&#x54CD;&#x5E94;&#x9996;&#x90E8;</code>&#x3001;<code>&#x5B9E;&#x4F53;&#x9996;&#x90E8;</code>.<br>    &#x5176;&#x4ED6;&#xFF0C;&#x53EF;&#x80FD;&#x5305;&#x542B;HTTP&#x7684;RFC&#x91CC;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x9996;&#x90E8;&#xFF08;Cookie&#x7B49;&#xFF09;&#x3002;</p>
<p><img src="../images/message.png" alt="HTTP_MESSAGE"></p>
<p><img src="../images/message_1.png" alt="HTTP_MESSAGE"></p>
<h4 id="&#x62A5;&#x6587;&#x548C;&#x5B9E;&#x4F53;&#x7684;&#x5DEE;&#x522B;">&#x62A5;&#x6587;&#x548C;&#x5B9E;&#x4F53;&#x7684;&#x5DEE;&#x522B;</h4>
<p>&#x62A5;&#x6587;&#xFF1A;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x662F;HTTP&#x901A;&#x4FE1;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x8D1F;&#x8D23;&#x63A7;&#x5236;HTTP&#x901A;&#x4FE1;&#x7684;&#x72B6;&#x6001;&#x548C;&#x5C5E;&#x6027;&#x63A7;&#x5236;&#x3002;
&#x5B9E;&#x4F53;&#xFF1A;&#x4F5C;&#x4E3A;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x7684;&#x6570;&#x636E;&#x6765;&#x4F20;&#x8F93;&#xFF0C;&#x7531;<code>&#x5B9E;&#x4F53;&#x9996;&#x90E8;</code>&#x548C;<code>&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;</code>&#x7EC4;&#x6210;&#x3002;&#x5982;&#xFF1A;post&#x8BF7;&#x6C42;&#x4E2D;&#x643A;&#x5E26;&#x7684;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#x548C;&#x54CD;&#x5E94;&#x4E2D;&#x643A;&#x5E26;&#x7684;&#x7F51;&#x9875;&#x6570;&#x636E;&#x90FD;&#x662F;&#x5B9E;&#x4F53;&#x3002;        </p>
<p><code>&#x5185;&#x5BB9;&#x7F16;&#x7801;</code>&#xFF1A;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x5B9E;&#x4F53;&#x4F20;&#x8F93;&#xFF0C;HTTP&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x529F;&#x80FD;&#xFF0C;&#x5C06;&#x5B9E;&#x4F53;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#x4F20;&#x8F93;&#x5E76;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x89E3;&#x7801;&#x6062;&#x590D;&#x3002;<br><code>&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;</code>&#xFF1A;&#x5728;&#x4F20;&#x8F93;&#x5927;&#x5BB9;&#x91CF;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x628A;&#x6570;&#x636E;&#x5206;&#x5272;&#x6210;&#x591A;&#x5757;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x9010;&#x6B65;&#x663E;&#x793A;&#x9875;&#x9762;&#x3002;<br>&#x5176;&#x4ED6;&#xFF1A;&#x7565;&#x3002;</p>
<h3 id="http&#x72B6;&#x6001;&#x7801;">HTTP&#x72B6;&#x6001;&#x7801;</h3>
<p>&#x72B6;&#x6001;&#x7801;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x63CF;&#x8FF0;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;&#x3002;&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x7801;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x6210;&#x529F;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;<br>&#x72B6;&#x6001;&#x7801;&#x7531;&#x4E09;&#x4F4D;&#x6570;&#x5B57;&#x548C;&#x63CF;&#x8FF0;&#x77ED;&#x8BED;&#x7EC4;&#x6210;&#xFF0C;&#x5982;&#xFF1A;<code>200 OK</code>        </p>
<table>
<thead>
<tr>
<th>&#x72B6;&#x6001;&#x7801;</th>
<th>&#x7C7B;&#x522B;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>1XX</td>
<td>Informational&#xFF08;&#x4FE1;&#x606F;&#x6027;&#x72B6;&#x6001;&#x7801;&#xFF09;</td>
<td>&#x8868;&#x793A;&#x63A5;&#x6536;&#x7684;&#x8BF7;&#x6C42;&#x6B63;&#x5728;&#x5904;&#x7406;</td>
</tr>
<tr>
<td>2XX</td>
<td>Success&#xFF08;&#x6210;&#x529F;&#x72B6;&#x6001;&#x7801;&#xFF09;</td>
<td>&#x8BF7;&#x6C42;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x3002;&#x5982;&#xFF1A;200 OK</td>
</tr>
<tr>
<td>3XX</td>
<td>Redirection&#xFF08;&#x91CD;&#x5B9A;&#x5411;&#x72B6;&#x6001;&#x7801;&#xFF09;</td>
<td>&#x8868;&#x793A;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x9644;&#x52A0;&#x64CD;&#x4F5C;&#x4EE5;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;</td>
</tr>
<tr>
<td>4XX</td>
<td>Client Error&#xFF08;&#x5BA2;&#x6237;&#x7AEF;&#x9519;&#x8BEF;&#x72B6;&#x6001;&#x7801;&#xFF09;</td>
<td>&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8BE5;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#xFF1A;404 Not Found</td>
</tr>
<tr>
<td>5XX</td>
<td>Server Error&#xFF08;&#x670D;&#x52A1;&#x7AEF;&#x9519;&#x8BEF;&#x72B6;&#x6001;&#x7801;&#xFF09;</td>
<td>&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x51FA;&#x9519;&#x3002;&#x5982;&#xFF1A;500 Internal Server Error</td>
</tr>
</tbody>
</table>
<h3 id="&#x4EC0;&#x4E48;&#x662F;https">&#x4EC0;&#x4E48;&#x662F;HTTPS</h3>
<h4 id="http&#x5B89;&#x5168;&#x7F3A;&#x70B9;">HTTP&#x5B89;&#x5168;&#x7F3A;&#x70B9;</h4>
<ol>
<li><p>&#x901A;&#x4FE1;&#x4F7F;&#x7528;&#x660E;&#x6587;&#xFF08;&#x4E0D;&#x52A0;&#x5BC6;&#xFF09;&#xFF0C;&#x62A5;&#x6587;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x7A83;&#x542C;<br>HTTP&#x672C;&#x8EAB;&#x4E0D;&#x5177;&#x5907;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#xFF0C;&#x65E0;&#x6CD5;&#x5BF9;&#x901A;&#x4FE1;&#x6574;&#x4F53;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;TCP/IP&#x901A;&#x4FE1;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x7A83;&#x542C;&#xFF0C;&#x5BFC;&#x81F4;HTTP&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x6027;&#x3002;<br>&#x89E3;&#x51B3;&#xFF1A;      </p>
<ul>
<li>&#x4F7F;&#x7528;SSL&#xFF08;&#x5B89;&#x5168;&#x5957;&#x63A5;&#x5C42;&#xFF09;&#x6216;TSL&#xFF08;&#x5B89;&#x5168;&#x5C42;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF09;&#x7684;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x6765;&#x52A0;&#x5BC6;HTTP&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x5C06;HTTP&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x52A0;&#x5BC6;&#x3002;&#x4F46;&#x662F;&#x52A0;&#x5BC6;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x53EF;&#x80FD;&#x88AB;&#x7BE1;&#x6539;&#x3002;</li>
</ul>
</li>
<li><p>&#x4E0D;&#x9A8C;&#x8BC1;&#x901A;&#x4FE1;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x53EF;&#x80FD;&#x906D;&#x9047;&#x4F2A;&#x88C5;&#x7684;&#x62A5;&#x6587;<br>HTTP&#x5728;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x65F6;&#x4E0D;&#x4F1A;&#x5BF9;&#x901A;&#x4FE1;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#x3002;<br>&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x662F;&#x5426;&#x76EE;&#x6807;&#x5BA2;&#x6237;&#x7AEF;&#x4EE5;&#x53CA;&#x4EA7;&#x751F;DoS&#x653B;&#x51FB;&#x7B49;&#x95EE;&#x9898;&#x3002;<br>HTTP&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x62E6;&#x622A;&#x7BE1;&#x6539;&#xFF0C;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x7AEF;&#x6536;&#x5230;&#x7684;&#x5047;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
</li>
<li><p>&#x65E0;&#x6CD5;&#x8BC1;&#x660E;&#x62A5;&#x6587;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x62A5;&#x6587;&#x53EF;&#x80FD;&#x906D;&#x7BE1;&#x6539;</p>
</li>
</ol>
<h4 id="https">HTTPS</h4>
<p><code>HTTPS = HTTP + &#x52A0;&#x5BC6; + &#x8BA4;&#x8BC1; + &#x5B8C;&#x6574;&#x6027;&#x4FDD;&#x62A4;</code><br>HTTP&#x5C06;&#x4E0A;&#x8FF0;&#x7684;&#x7F3A;&#x70B9;&#x6539;&#x6B63;&#x540E;&#xFF0C;&#x505A;&#x5230;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x52A0;&#x5BC6;&#x5904;&#x7406;&#x3001;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x8BA4;&#x8BC1;&#x3001;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x5B8C;&#x6574;&#x6027;&#x4FDD;&#x62A4;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x662F;HTTPS&#x3002;     </p>
<p>HTTPS&#x5E76;&#x4E0D;&#x662F;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x65B0;&#x534F;&#x8BAE;&#xFF0C;&#x53EA;&#x662F;&#x5C06;HTTP&#x901A;&#x4FE1;&#x63A5;&#x53E3;&#x7528;SSL&#x548C;TSL&#x534F;&#x8BAE;&#x4EE3;&#x66FF;&#x3002;&#x901A;&#x5E38;HTTP&#x76F4;&#x63A5;&#x548C;TCP&#x901A;&#x4FE1;&#xFF0C;HTTPS&#x53D8;&#x4E3A;&#x4E86;HTTP--&gt;SSL--&gt;TCP&#x3002;
&#x5373;&#x5728;HTTP&#x4E0E;TCP&#x901A;&#x4FE1;&#x4E4B;&#x95F4;&#x52A0;&#x4E86;&#x4E00;&#x5C42;SSL&#x534F;&#x8BAE;&#x3002;<br>&#x5728;&#x91C7;&#x7528;SSL&#x540E;&#xFF0C;HTTP &#x5C31;&#x62E5;&#x6709;&#x4E86; HTTPS &#x7684;&#x52A0;&#x5BC6;&#x3001;&#x8BC1;&#x4E66;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x4FDD;&#x62A4;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x3002;     </p>
<p>&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;:       </p>
<ul>
<li>&#x5171;&#x4EAB;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;/&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;&#x52A0;&#x89E3;&#x5BC6;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x8F6C;&#x4EA4;&#x5BC6;&#x94A5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B58;&#x5728;&#x98CE;&#x9669;&#x3002;</li>
<li>&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;/&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;&#x4F7F;&#x7528;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#xFF0C;&#x79C1;&#x6709;&#x5BC6;&#x94A5;&#x89E3;&#x5BC6;&#xFF0C;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x6162;&#xFF0C;&#x4F46;&#x662F;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;       </li>
</ul>
<p>HTTPS&#x91C7;&#x7528;&#x6DF7;&#x5408;&#x52A0;&#x5BC6;&#x673A;&#x5236;&#x3002;&#x5728;&#x4EA4;&#x6362;&#x5BC6;&#x94A5;&#x73AF;&#x8282;&#x4F7F;&#x7528;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x5EFA;&#x7ACB;&#x901A;&#x4FE1;&#x4EA4;&#x6362;&#x62A5;&#x6587;&#x9636;&#x6BB5;&#x5219;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#x3002;<br>&#x901A;&#x4FE1;&#x65F6;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x5BC6;&#x94A5;&#x6548;&#x7387;&#x6BD4;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x9AD8;&#x3002;        </p>
<p>&#x7531;&#x4E8E;HTTPS&#x91C7;&#x7528;SSL&#x5BFC;&#x81F4;&#x6BD4;HTTP&#x6162;2&#x5230;100&#x500D;&#x3002;&#x4E3B;&#x8981;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x670D;&#x52A1;&#x7AEF;&#x52A0;&#x89E3;&#x5BC6;&#x8017;&#x8D39;CPU&#x7B49;&#x8D44;&#x6E90;&#x548C;&#x8FDB;&#x884C;SSL&#x901A;&#x4FE1;&#x5BFC;&#x81F4;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x6162;&#x3002;</p>
<h3 id="http&#x73B0;&#x72B6;&#x548C;websocket">HTTP&#x73B0;&#x72B6;&#x548C;websocket</h3>
<h4 id="http&#x901A;&#x4FE1;&#x74F6;&#x9888;">HTTP&#x901A;&#x4FE1;&#x74F6;&#x9888;</h4>
<p>&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x4E2D;web&#x7F51;&#x7AD9;&#x4F1A;&#x6709;&#x9891;&#x7E41;&#x4E14;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x66F4;&#x65B0;&#xFF0C;&#x9875;&#x9762;&#x9700;&#x8981;&#x5B9E;&#x65F6;&#x5FEB;&#x901F;&#x7684;&#x5185;&#x5BB9;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;&#x9891;&#x7E41;&#x7684;&#x53D1;&#x9001;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x9020;&#x6210;&#x8D44;&#x6E90;&#x6D6A;&#x8D39;&#x3002;
&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x4EE5;&#x4E0B;HTTP&#x7684;&#x7279;&#x6027;&#x5BFC;&#x81F4;&#x4E86;&#x53D1;&#x9001;&#x74F6;&#x9888;&#x3002; </p>
<ul>
<li>&#x4E00;&#x6761;&#x8FDE;&#x63A5;&#x53EA;&#x80FD;&#x53D1;&#x9001;&#x4E00;&#x6761;&#x8BF7;&#x6C42;&#x3002;        </li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x80FD;&#x63A5;&#x6536;&#x9664;&#x4E86;&#x8BF7;&#x6C42;&#x670D;&#x52A1;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x4E4B;&#x5916;&#x7684;&#x54CD;&#x5E94;&#xFF08;&#x670D;&#x52A1;&#x7AEF;&#x65E0;&#x6CD5;&#x63A8;&#x9001;&#x6D88;&#x606F;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x3002;      </li>
<li>&#x8BF7;&#x6C42;/&#x54CD;&#x5E94;&#x9996;&#x90E8;&#x672A;&#x7ECF;&#x538B;&#x7F29;&#x5C31;&#x53D1;&#x9001;&#x3002;&#x9996;&#x90E8;&#x4FE1;&#x606F;&#x8D8A;&#x591A;&#x5EF6;&#x8FDF;&#x8D8A;&#x5927;&#x3002;       </li>
<li>&#x9891;&#x7E41;&#x7684;&#x8BF7;&#x6C42;&#x4F1A;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x9996;&#x90E8;&#xFF0C;&#x9020;&#x6210;&#x6D6A;&#x8D39;&#x3002;        </li>
<li>&#x53EF;&#x4EFB;&#x610F;&#x9009;&#x62E9;&#x6570;&#x636E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x3002;&#x975E;&#x5F3A;&#x5236;&#x538B;&#x7F29;&#x53D1;&#x9001;&#x3002;      </li>
</ul>
<h4 id="websocket">WebSocket</h4>
<p>WebSocket&#xFF1A;Web&#x6D4F;&#x89C8;&#x5668;&#x4E0E;Web&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5168;&#x53CC;&#x5DE5;&#x901A;&#x4FE1;&#x6807;&#x51C6;&#x3002;<br>Web&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x8D77;WebSocket&#x534F;&#x8BAE;&#x7684;&#x901A;&#x4FE1;&#x8FDE;&#x63A5;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x53D1;&#x9001;JSON&#x3001;XML&#x3001;HTML&#x6216;&#x56FE;&#x7247;&#x7B49;&#x4EFB;&#x610F;&#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x3002;<br>&#x7531;&#x4E8E;WebSocket&#x662F;&#x5EFA;&#x7ACB;&#x5728;HTTP&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x8FDE;&#x63A5;&#x7684;&#x53D1;&#x8D77;&#x65B9;&#x4ECD;&#x65E7;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x8981;&#x8FDE;&#x63A5;&#x6210;&#x529F;&#xFF0C;&#x53CC;&#x65B9;&#x5C31;&#x53EF;&#x4EE5;&#x4E92;&#x53D1;&#x6D88;&#x606F;&#x3002;<br>WebSocket&#x901A;&#x4FE1;&#x4F7F;&#x7528;&#x5230;HTTP&#x7684;Upgrade&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#xFF0C;&#x544A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x63E1;&#x624B;&#x7684;&#x76EE;&#x7684;&#x3002;
&#x670D;&#x52A1;&#x7AEF;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801;101 Switching Protocols&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x8868;&#x793A;&#x63E1;&#x624B;&#x6210;&#x529F;&#x3002;&#x4E4B;&#x540E;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x5C06;&#x4ECE;HTTP&#x5207;&#x6362;&#x4E3A;WebSocket&#x3002;      </p>
<p><img src="../images/websocket.png" alt="WEBSOCKET"></p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../index.html" class="navigation navigation-prev " aria-label="Previous page: 简介"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../algorithm/algorithm.html" class="navigation navigation-next " aria-label="Next page: 算法"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
